cfg/Documents/РасходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>РасходнаяНакладная</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСПокупателями</xr:Item>
				<xr:Item>AccountingRegister.Основной</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.РезервыТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cfg/AccumulationRegisters/РезервыТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РезервыТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cfg/AccumulationRegisters/ОстаткиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНоменклатуры</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cfg/InformationRegisters/ПараметрыУчетнойПолитики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыУчетнойПолитики</Name>
			<InformationRegisterPeriodicity>Year</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МетодСписания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыСписания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cfg/AccumulationRegisters/ЗаказыПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПокупателей</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоЗаказано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОтгружено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоОтменено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cfg/AccountingRegisters/Основной.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccountingRegister>
		<Properties>
			<Name>Основной</Name>
			<ChartOfAccounts>ChartOfAccounts.Основной</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Основной.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

cfg/Enums/МетодыСписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>МетодыСписания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЛИФО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФИФО</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/Documents/РасходнаяНакладная/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = Товары.Итог("Сумма");
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		// Заполнение шапки
		ВидЦены = ДанныеЗаполнения.ВидЦены;
		Договор = ДанныеЗаполнения.Договор;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Менеджер = ДанныеЗаполнения.Менеджер;
		Организация = ДанныеЗаполнения.Организация;
		Склад = ДанныеЗаполнения.Склад;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	РезервыТоваровОстатки.Номенклатура КАК Номенклатура,
			               |	ЕСТЬNULL(РезервыТоваровОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
			               |ИЗ
			               |	РегистрНакопления.РезервыТоваров.Остатки(&Дата, Номенклатура = &Номенклатура) КАК РезервыТоваровОстатки
			               |ИТОГИ
			               |	СУММА(КоличествоОстаток)
			               |ПО
			               |	Номенклатура";
			Запрос.УстановитьПараметр("Дата", ДокументОснование.Дата);
			Запрос.УстановитьПараметр("Номенклатура", ТекСтрокаТовары.Номенклатура);
			Результат = Запрос.Выполнить();
			Выборка = результат.Выбрать();
			Если Выборка.Следующий() И Выборка.КоличествоОстаток = 0 Тогда
				продолжить;
			КонецЕсли;
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
			НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ТаблицаБлокировки = Новый ТаблицаЗначений;
	ТаблицаБлокировки.Колонки.Добавить("Организация");
	ТаблицаБлокировки.Колонки.Добавить("Номенклатура");
	ТаблицаБлокировки.Колонки.Добавить("Склад");
	
	ТаблицаБлокировки.ЗагрузитьКолонку(Товары.ВыгрузитьКолонку("Номенклатура"), "Номенклатура");
	ТаблицаБлокировки.ЗаполнитьЗначения(Склад, "Склад");
	ТаблицаБлокировки.ЗаполнитьЗначения(Организация, "Организация");
	
	Блокировка = Новый БлокировкаДанных;
	Элемент = Блокировка.Добавить("РегистрНакопления.ОстаткиНоменклатуры");
	Элемент.Режим = РежимБлокировкиДанных.Исключительный;
	Элемент.ИсточникДанных = ТаблицаБлокировки;
	Элемент.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	Элемент.ИспользоватьИзИсточникаДанных("Склад", "Склад");
	Элемент.ИспользоватьИзИсточникаДанных("Организация", "Организация");
	Блокировка.Заблокировать();
	
	ТекущаяУчетанаяПолитика = РегистрыСведений.ПараметрыУчетнойПолитики.ПолучитьПоследнее(Дата, Новый Структура("Организация", Организация));
	Если ТекущаяУчетанаяПолитика.МетодСписания = перечисления.МетодыСписания.ФИФО Тогда
		Порядок = " ВОЗР ";
	ИначеЕсли ТекущаяУчетанаяПолитика.МетодСписания = перечисления.МетодыСписания.ЛИФО Тогда
		Порядок = " УБЫВ ";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
		|	СУММА(РасходнаяНакладнаяТовары.Количество) КАК Количество,
		|	РасходнаяНакладнаяТовары.Сумма КАК Сумма,
		|	РасходнаяНакладнаяТовары.Ссылка.ДокументОснование КАК ДокументОснование
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
		|ГДЕ
		|	РасходнаяНакладнаяТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяНакладнаяТовары.Номенклатура,
		|	РасходнаяНакладнаяТовары.Сумма,
		|	РасходнаяНакладнаяТовары.Ссылка.ДокументОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РезервыТоваровОстатки.Номенклатура КАК Номенклатура,
		|	РезервыТоваровОстатки.ЗаказПокупателя КАК ЗаказПокупателя,
		|	РезервыТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТРезервы
		|ИЗ
		|	РегистрНакопления.РезервыТоваров.Остатки(
		|			&МоментВремени,
		|			Организация = &Организация
		|				И Склад = &Склад
		|				И Номенклатура В
		|					(ВЫБРАТЬ
		|						ВТТовары.Номенклатура КАК Номенклатура
		|					ИЗ
		|						ВТТовары КАК ВТТовары)) КАК РезервыТоваровОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТовары.Номенклатура КАК Номенклатура,
		|	ВТТовары.Количество КАК КоличествоДокумента,
		|	ВТТовары.Сумма КАК СуммаДокумента,
		|	ОстаткиНоменклатурыОстатки.Партия КАК Партия,
		|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ЕСТЬNULL(ВТРезервы.КоличествоОстаток, 0) КАК КоличествоРезерв,
		|	ЕСТЬNULL(ВТРезервыдругиеЗаказы.КоличествоОстаток, 0) КАК КолРезервДругие,
		|	ВТТовары.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	ВТТовары КАК ВТТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиНоменклатуры.Остатки(
		|				&МоментВремени,
		|				Организация = &Организация
		|					И Склад = &Склад
		|					И Номенклатура В
		|						(ВЫБРАТЬ
		|							ВТТовары.Номенклатура КАК Номенклатура
		|						ИЗ
		|							ВТТовары КАК ВТТовары)) КАК ОстаткиНоменклатурыОстатки
		|		ПО ВТТовары.Номенклатура = ОстаткиНоменклатурыОстатки.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРезервы КАК ВТРезервы
		|		ПО ВТТовары.Номенклатура = ВТРезервы.Номенклатура
		|			И (ВТРезервы.ЗаказПокупателя = &ДокументОснование)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРезервы КАК ВТРезервыдругиеЗаказы
		|		ПО ВТТовары.Номенклатура = ВТРезервыдругиеЗаказы.Номенклатура
		|			И (ВТРезервыдругиеЗаказы.ЗаказПокупателя <> &ДокументОснование)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОстаткиНоменклатурыОстатки.Партия.Дата
		|ИТОГИ
		|	МАКСИМУМ(КоличествоДокумента),
		|	МАКСИМУМ(СуммаДокумента),
		|	СУММА(КоличествоОстаток),
		|	МАКСИМУМ(КоличествоРезерв),
		|	МАКСИМУМ(КолРезервДругие)
		|ПО
		|	Номенклатура";
	
	СтрокаУпорядочить = "|УПОРЯДОЧИТЬ ПО
		|	ОстаткиНоменклатурыОстатки.Партия.Дата";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, СтрокаУпорядочить, СтрокаУпорядочить + Порядок);
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		
		Если ВыборкаНоменклатура.КоличествоОстаток - ВыборкаНоменклатура.КолРезервДругие < ВыборкаНоменклатура.КоличествоДокумента Тогда
			Отказ = Истина;
			Сообщить("Не хватает товара " + ВыборкаНоменклатура.Номенклатура + ". ОстатокТовара: " + (ВыборкаНоменклатура.КоличествоОстаток - ВыборкаНоменклатура.КолРезервДругие));
		КонецЕсли;
		
		ВыборкаПартия = ВыборкаНоменклатура.Выбрать();
		ОсталосьСписать = ВыборкаНоменклатура.КоличествоДокумента;
		
		ИтогоСуммаСпис = 0;
		
		Пока ВыборкаПартия.Следующий() Цикл
			Если ВыборкаПартия.КоличествоОстаток < ОсталосьСписать Тогда
				КоличСпис = ВыборкаПартия.КоличествоОстаток;
				СуммаСпис = ВыборкаПартия.СуммаОстаток;
				ОсталосьСписать = ОсталосьСписать - ВыборкаПартия.КоличествоОстаток;
			Иначе
				КоличСпис = ОсталосьСписать;
				СуммаСпис = ВыборкаПартия.СуммаОстаток / ВыборкаПартия.КоличествоОстаток * ОсталосьСписать;
				ОсталосьСписать = 0;
			КонецЕсли;
			
			Движение = Движения.ОстаткиНоменклатуры.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Номенклатура = ВыборкаПартия.Номенклатура;
			Движение.Партия = ВыборкаПартия.Партия;
			Движение.Склад = Склад;
			Движение.Количество = КоличСпис; 
			Движение.Сумма = СуммаСпис; 
			
			ИтогоСуммаСпис = ИтогоСуммаСпис + СуммаСпис 
			
		КонецЦикла;
		
		ДвижениеПродажи = Движения.Продажи.Добавить();
		ДвижениеПродажи.Период = Дата;
		ДвижениеПродажи.Организация = Организация;
		ДвижениеПродажи.Контрагент = Контрагент;
		ДвижениеПродажи.Номенклатура = ВыборкаНоменклатура.Номенклатура;
		ДвижениеПродажи.Количество = ВыборкаНоменклатура.КоличествоДокумента;
		ДвижениеПродажи.Сумма = ВыборкаНоменклатура.СуммаДокумента;
		ДвижениеПродажи.ЗаказПокупателя = ДокументОснование;
		ДвижениеПродажи.Себестоимость = ИтогоСуммаСпис; 
		
		ДвижениеЗаказ = Движения.ЗаказыПокупателей.Добавить();
		ДвижениеЗаказ.Период = Дата;
		ДвижениеЗаказ.Номенклатура = ВыборкаНоменклатура.Номенклатура;
		ДвижениеЗаказ.Организация = Организация;
		ДвижениеЗаказ.Контрагент = Контрагент;
		ДвижениеЗаказ.ЗаказПокупателя = Ссылка;
		ДвижениеЗаказ.КоличествоОтгружено = ВыборкаНоменклатура.КоличествоДокумента;
		
		Движение = Движения.РезервыТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Номенклатура = ВыборкаНоменклатура.Номенклатура;
		Движение.Склад = Склад;
		Движение.ЗаказПокупателя = ДокументОснование;
		Если ВыборкаНоменклатура.КоличествоРезерв < ВыборкаНоменклатура.КоличествоДокумента Тогда
			Движение.Количество = ВыборкаНоменклатура.КоличествоРезерв;
		Иначе
			Движение.Количество = ВыборкаНоменклатура.КоличествоДокумента; 
		КонецЕсли;
		
	КонецЦикла;
		
	Движения.Продажи.Записывать = Истина;
	Движения.РезервыТоваров.Записывать = Истина;
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	Движения.ЗаказыПокупателей.Записывать = Истина; 
	
	//Бух учет
	Движения.Основной.Записывать = Истина;
	
		Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяТовары.Номенклатура КАК Номенклатура,
		|	СУММА(РасходнаяНакладнаяТовары.Количество) КАК Количество,
		|	СУММА(РасходнаяНакладнаяТовары.Сумма) КАК Сумма,
		|	РасходнаяНакладнаяТовары.Ссылка.Контрагент КАК Контрагент,
		|	РасходнаяНакладнаяТовары.Ссылка.Склад КАК Склад,
		|	РасходнаяНакладнаяТовары.Ссылка.Дата КАК Дата
		|ПОМЕСТИТЬ ВТТовары
		|ИЗ
		|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
		|ГДЕ
		|	РасходнаяНакладнаяТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяНакладнаяТовары.Номенклатура,
		|	РасходнаяНакладнаяТовары.Ссылка.Контрагент,
		|	РасходнаяНакладнаяТовары.Ссылка.Склад,
		|	РасходнаяНакладнаяТовары.Ссылка.Дата
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТовары.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(ВТТовары.Количество, 0) КАК КоличествоДокумента,
		|	ВТТовары.Сумма КАК СуммаДокумента,
		|	ЕСТЬNULL(ОсновнойОстатки.КоличествоОстатокДт, 0) КАК КолОст,
		|	ЕСТЬNULL(ОсновнойОстатки.СуммаОстатокДт, 0) КАК СумОст,
		|	ВТТовары.Контрагент КАК Контрагент,
		|	ВТТовары.Склад КАК Склад,
		|	ВТТовары.Дата КАК Дата
		|ИЗ
		|	ВТТовары КАК ВТТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Основной.Остатки(
		|				&МоментВремени,
		|				Счет В ИЕРАРХИИ (&Счет41),
		|				&ВидСубконто,
		|				Организация = &Организация
		|					И Субконто1 В
		|						(ВЫБРАТЬ
		|							ВТТовары.Номенклатура КАК Номенклатура
		|						ИЗ
		|							ВТТовары КАК ВТТовары)) КАК ОсновнойОстатки
		|		ПО ВТТовары.Номенклатура = ОсновнойОстатки.Субконто1";
	
	СтрокаУпорядочить = "|УПОРЯДОЧИТЬ ПО
		|	ОстаткиНоменклатурыОстатки.Партия.Дата";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, СтрокаУпорядочить, СтрокаУпорядочить + Порядок);
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Счет41", ПланыСчетов.Основной.ТоварыНаСкладах);
	МассивВидСубконто = Новый Массив;
	МассивВидСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);	
	Запрос.УстановитьПараметр("ВидСубконто", МассивВидСубконто);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	
	Счет90_2 = ПланыСчетов.Основной.СебестоимостьПродаж;
	Счет90_1 = ПланыСчетов.Основной.Выручка; 
	Счет41 = ПланыСчетов.Основной.ТоварыНаСкладах; 
	Счет60 = ПланыСчетов.Основной.РасчетыСПокупателями;
	СчетПр = ПланыСчетов.Основной.ПродажиПоНоменклатуре;
	Счет62_01 = ПланыСчетов.Основной.РасчетыСПокупателямиИЗаказчиками;
	Счет62_02 = ПланыСчетов.Основной.РасчетыПоАвансамПолученным;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.КоличествоДокумента > Выборка.КолОст тогда
			Сообщить("Не хватает товара " + Выборка.Номенулатура + ". Остаток товара: " + Выборка.КолОст);
			Отказ = Истина;
		КонецЕсли;	
		
		Если НЕ Отказ Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
			               |	ОстаткиНоменклатурыОстатки.Склад КАК Склад,
			               |	ЕСТЬNULL(ОстаткиНоменклатурыОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток
			               |ИЗ
			               |	РегистрНакопления.ОстаткиНоменклатуры.Остатки(&Дата, ) КАК ОстаткиНоменклатурыОстатки
			               |ГДЕ
			               |	ОстаткиНоменклатурыОстатки.Номенклатура = &Номенклатура
			               |	И ОстаткиНоменклатурыОстатки.Склад = &Склад";
			Запрос.УстановитьПараметр("Номенклатура", Выборка.Номенклатура);
			Запрос.УстановитьПараметр("Склад", Выборка.Склад);
			Запрос.УстановитьПараметр("Дата", Выборка.Дата);
			
			Результат = Запрос.Выполнить();
			ВыборкаПоСкладу = Результат.Выбрать();
			ВыборкаПоСкладу.Следующий();
			
			Если ВыборкаПоСкладу.КоличествоОстаток < Выборка.КоличествоДокумента Тогда
				Сообщить("На складе " + ВыборкаПоСкладу.Склад + " не хвататет товаров для списания");
				Возврат;
			КонецЕсли;
			
			Если Выборка.КолОст = Выборка.КоличествоДокумента Тогда
				СуммаСписания = Выборка.СумОст;
			Иначе
				СуммаСписания = Выборка.СумОст / Выборка.колОст * Выборка.КоличествоДокумента;
			КонецЕсли;
			
			// С/С
			Движение = Движения.Основной.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Сумма = СуммаСписания;
			Движение.СчетДт = Счет90_2;
			Движение.СчетКт = Счет41;
			БухгалтерскийУчет.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, "Номенклатура", Выборка.Номенклатура);
			БухгалтерскийУчет.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, "Склады", Склад);
			//Если Движение.СчетКт.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура, "ВидСубконто") <> Неопределено Тогда
			//	Движение.СубконтоКт.Номенклатура = Выборка.Номенклатура;				
			//КонецЕсли;
			Если Движение.СчетКт.Количественный Тогда
				Движение.КоличествоКт = Выборка.КоличествоДокумента;	
			КонецЕсли;	
			
			// Выручка
			Движение = Движения.Основной.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.Сумма = Выборка.СуммаДокумента;
			Движение.СчетДт = Счет60;
			//Движение.СубконтоДт.Контрагенты = Контрагент;
			БухгалтерскийУчет.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, "Контрагенты", Выборка.Контрагент);
			Движение.СчетКт = Счет90_1;
					
			Движение = Движения.Основной.Добавить();
			Движение.Период = Дата; 
			Движение.Организация = Организация;
			Движение.СчетДт = Счет62_01;
			Движение.СчетКт = Счет90_1;
			Движение.Сумма = Выборка.СуммаДокумента;
			БухгалтерскийУчет.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, "Контрагенты", Контрагент);
			СуммаАванса = ПолучитьОстатокПоСчету(Организация, Контрагент, Дата);	
			Если СуммаАванса > 0 И Выборка.СуммаДокумента > 0 Тогда
				Движение = Движения.Основной.Добавить();
				Движение.Период = Дата; 
				Движение.Организация = Организация;
				Движение.СчетДт = Счет62_02;
				Движение.СчетКт = Счет62_01;
				//Движение.СубконтоДт.Контрагенты = Контрагент;
				БухгалтерскийУчет.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, "Контрагенты", Контрагент);
				Если Выборка.СуммаДокумента < СуммаАванса Тогда
					Движение.Сумма = Выборка.СуммаДокумента;
				Иначе
					Движение.Сумма = СуммаАванса;		
				КонецЕсли;	
			КонецЕсли;
			
			
			//Продажи(забалансовый)
			Движение = Движения.Основной.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			Движение.СчетДт = СчетПр;
			БухгалтерскийУчет.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, "Номенклатура", Выборка.Номенклатура);
			БухгалтерскийУчет.УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, "Контрагенты", Контрагент);
			Если Движение.СчетДт.Количественный Тогда
				Движение.КоличествоДт = Выборка.КоличествоДокумента;	
			 КонецЕсли;
		    Движение.Сумма = Выборка.СуммаДокумента;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьОстатокПоСчету(Организация, Контрагент, Дата)
	
	Счет = ПланыСчетов.Основной.РасчетыПоАвансамПолученным;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(ОсновнойОстатки.СуммаОстатокКт, 0) КАК СуммаОстатокКт
	               |ИЗ
	               |	РегистрБухгалтерии.Основной.Остатки(
	               |			&Дата,
	               |			Счет = &Счет,
	               |			,
	               |			Организация = &Организация
	               |				И Субконто1 = &Контрагент) КАК ОсновнойОстатки";
	
	Запрос.УстановитьПараметр("Счет", Счет);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Сумма = Выборка.Следующий();
	Возврат Сумма;

КонецФункции;
